In [1]:
import pandas as pd

In [2]:
pNumber = pd.read_csv('./data/population_number.csv', encoding='euc-kr', index_col='도시')

In [3]:
pNumber

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [4]:
pNumber.count()

지역      4
2015    4
2010    3
2005    2
2000    4
dtype: int64

In [5]:
pNumber['2010'].sort_values(ascending=False)

도시
서울    9631482.0
인천    2632035.0
대구    2431774.0
부산          NaN
Name: 2010, dtype: float64

In [6]:
pNumber.sort_values(by='2010', ascending=False)

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437

In [7]:
pNumber.sort_values(by=['2010', '2005'], ascending=False)

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437

In [8]:
score = pd.read_csv('./data/score.csv', encoding='euc-kr', index_col='과목')
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [9]:
score.sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [10]:
score.sum().sort_values(ascending=False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [11]:
score.sum(axis=1).sort_values(ascending=False)

과목
사회    298
영어    282
국어    253
수학    201
과학    163
dtype: int64

In [12]:
score.T.sum().sort_values(ascending=False)

과목
사회    298
영어    282
국어    253
수학    201
과학    163
dtype: int64

In [13]:
score['합계'] = score.T.sum()

In [14]:
score

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

In [15]:
score['평균'] = score.T[0:4].mean()

In [16]:
score

    1반  2반  3반  4반   합계     평균
과목
수학  45  44  73  39  201  50.25
영어  76  92  45  69  282  70.50
국어  47  92  45  69  253  63.25
사회  92  81  85  40  298  74.50
과학  11  79  47  26  163  40.75

In [27]:
score.loc['반평균'] = score[:-1].mean()

In [28]:
score

       1반    2반    3반    4반     합계     평균
과목
수학   45.0  44.0  73.0  39.0  201.0  50.25
영어   76.0  92.0  45.0  69.0  282.0  70.50
국어   47.0  92.0  45.0  69.0  253.0  63.25
사회   92.0  81.0  85.0  40.0  298.0  74.50
과학   11.0  79.0  47.0  26.0  163.0  40.75
반평균  54.2  77.6  59.0  48.6  239.4  59.85

In [40]:
score.iloc[0:5, 0:4].max(axis=1)

과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64

In [41]:
score.iloc[0:5, 0:4].min(axis=1)

과목
수학    39.0
영어    45.0
국어    45.0
사회    40.0
과학    11.0
dtype: float64

In [39]:
score.iloc[:, 0:4].max(axis=1)

과목
수학     73.0
영어     92.0
국어     92.0
사회     92.0
과학     79.0
반평균    77.6
dtype: float64

In [42]:
score

       1반    2반    3반    4반     합계     평균
과목
수학   45.0  44.0  73.0  39.0  201.0  50.25
영어   76.0  92.0  45.0  69.0  282.0  70.50
국어   47.0  92.0  45.0  69.0  253.0  63.25
사회   92.0  81.0  85.0  40.0  298.0  74.50
과학   11.0  79.0  47.0  26.0  163.0  40.75
반평균  54.2  77.6  59.0  48.6  239.4  59.85

In [43]:
bmi = pd.read_csv('./data/bmi.csv')
bmi

       height  weight   label
0         140      45  normal
1         145      72     fat
2         150      61     fat
3         137      56     fat
4         192      48    thin
...       ...     ...     ...
19995     157      67     fat
19996     138      40  normal
19997     163      62  normal
19998     169      68  normal
19999     183      39    thin

[20000 rows x 3 columns]

In [80]:
fat = bmi[bmi['label'] == 'fat']['label'].count()
fat

7712

In [76]:
normal = bmi[bmi['label'] == 'normal']['label'].count()

In [77]:
thin = bmi[bmi['label'] == 'thin']['label'].count()

In [81]:
bmi['label'].value_counts()

fat       7712
thin      6338
normal    5950
Name: label, dtype: int64

In [88]:
bmi[(bmi['height'] >= 170) & (bmi['label'] == 'fat')]['label'].count()

222

In [95]:
bmi[(bmi['height'] >= 170) & (bmi['label'] == 'fat')]['weight'].mean()

77.35585585585585